### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecr_image_base"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/spor/./apps/designmanual-frontend/ecr_image_base" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ has_value_wo    = false -> (known after apply)
      ~ id              = "/__deployment__/spor/./apps/designmanual-frontend/ecr_image_base" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/spor/./apps/designmanual-frontend/ecr_image_base" -> "/__deployment__/spor/apps/designmanual-frontend/ecr_image_base" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_cluster_name"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/spor/./apps/designmanual-frontend/ecs_cluster_name" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ has_value_wo    = false -> (known after apply)
      ~ id              = "/__deployment__/spor/./apps/designmanual-frontend/ecs_cluster_name" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/spor/./apps/designmanual-frontend/ecs_cluster_name" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_cluster_name" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_container_name"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/spor/./apps/designmanual-frontend/ecs_container_name" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ has_value_wo    = false -> (known after apply)
      ~ id              = "/__deployment__/spor/./apps/designmanual-frontend/ecs_container_name" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/spor/./apps/designmanual-frontend/ecs_container_name" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_container_name" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_container_port"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/spor/./apps/designmanual-frontend/ecs_container_port" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ has_value_wo    = false -> (known after apply)
      ~ id              = "/__deployment__/spor/./apps/designmanual-frontend/ecs_container_port" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/spor/./apps/designmanual-frontend/ecs_container_port" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_container_port" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_service_name"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/spor/./apps/designmanual-frontend/ecs_service_name" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ has_value_wo    = false -> (known after apply)
      ~ id              = "/__deployment__/spor/./apps/designmanual-frontend/ecs_service_name" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/spor/./apps/designmanual-frontend/ecs_service_name" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_service_name" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 5c0d95d852f352744aa1fd96a3586a75eb88091b*
*Plan generated at: 2026-01-09 08:02:06 UTC*
